app/Models/UserModel.php

    public function checkUser($username,$password)
    {
        return $this->where(['username' => $username])->where(['password' => $password])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'HuyMups'
AND `password` = 'e10adc3949ba59abbe56e057f20f883e'
 LIMIT 1